// Задача 60. ...Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. Напишите программу, которая будет построчно выводить массив, добавляя индексы каждого элемента.
// Массив размером 2 x 2 x 2
// 66(0,0,0) 25(0,1,0) 27(0,0,1) 90(0,1,1)
// 34(1,0,0) 41(1,1,0) 26(1,0,1) 55(1,1,1)

int[,,] Create3dMatrixRndInt(int row, int col, int dep)
{
    int[,,] matrix = new int[row, col, dep];
    int number = 10;

    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            for (int k = 0; k < matrix.GetLength(2); k++)
            {
                matrix[i, j, k] = number++;
            }
        }
    }
    return matrix;
}

void Print3dMatrix(int[,,] matrix)
{
    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            for (int k = 0; k < matrix.GetLength(2); k++)
            {
                Console.Write($"{matrix[i, j, k]}[{i}, {j}, {k}]  ");
            }
        }
        Console.WriteLine();
    }
}

Console.Write("Введите количество сторк матрицы: ");
int rows = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите количество столбцов матрицы: ");
int columns = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите глубину матрицы: ");
int depth = Convert.ToInt32(Console.ReadLine());

int[,,] array3d = Create3dMatrixRndInt(rows, columns, depth);
Print3dMatrix(array3d);